daedaleanai/stm32f103_xvcusb/stm32f103_md.h
#pragma once

/**

 Based on  stm32f10x.h  V3.5.0  11-March-2011
 COPYRIGHT 2011 STMicroelectronics</center>

  #define STM32F10X_MD */ /*!< STM32F10X_MD: STM32 Medium density devices 
  - Medium-density devices are STM32F101xx, STM32F102xx and STM32F103xx microcontrollers where the Flash memory density ranges between 64 and 128 Kbytes.

  */

#include <stdint.h>

#include "core_cm3.h"

/**
 * IO definitions
 *
 * define access restrictions to peripheral registers
 */

#define __I volatile const /*!< defines 'read only' permissions      */
#define __O volatile       /*!< defines 'write only' permissions     */
#define __IO volatile      /*!< defines 'read / write' permissions   */

/**
 * @brief Analog to Digital Converter
 */

struct ADC_Type {
	__IO uint32_t SR;
	__IO uint32_t CR1;
	__IO uint32_t CR2;
	__IO uint32_t SMPR1;
	__IO uint32_t SMPR2;
	__IO uint32_t JOFR1;
	__IO uint32_t JOFR2;
	__IO uint32_t JOFR3;
	__IO uint32_t JOFR4;
	__IO uint32_t HTR;
	__IO uint32_t LTR;
	__IO uint32_t SQR1;
	__IO uint32_t SQR2;
	__IO uint32_t SQR3;
	__IO uint32_t JSQR;
	__IO uint32_t JDR1;
	__IO uint32_t JDR2;
	__IO uint32_t JDR3;
	__IO uint32_t JDR4;
	__IO uint32_t DR;
};

/**
 * @brief Backup Registers
 */

struct BKP_Type {
	uint32_t RESERVED0;
	__IO uint16_t DR1;
	uint16_t      RESERVED1;
	__IO uint16_t DR2;
	uint16_t      RESERVED2;
	__IO uint16_t DR3;
	uint16_t      RESERVED3;
	__IO uint16_t DR4;
	uint16_t      RESERVED4;
	__IO uint16_t DR5;
	uint16_t      RESERVED5;
	__IO uint16_t DR6;
	uint16_t      RESERVED6;
	__IO uint16_t DR7;
	uint16_t      RESERVED7;
	__IO uint16_t DR8;
	uint16_t      RESERVED8;
	__IO uint16_t DR9;
	uint16_t      RESERVED9;
	__IO uint16_t DR10;
	uint16_t      RESERVED10;
	__IO uint16_t RTCCR;
	uint16_t      RESERVED11;
	__IO uint16_t CR;
	uint16_t      RESERVED12;
	__IO uint16_t CSR;
	uint16_t      RESERVED13[5];
	__IO uint16_t DR11;
	uint16_t      RESERVED14;
	__IO uint16_t DR12;
	uint16_t      RESERVED15;
	__IO uint16_t DR13;
	uint16_t      RESERVED16;
	__IO uint16_t DR14;
	uint16_t      RESERVED17;
	__IO uint16_t DR15;
	uint16_t      RESERVED18;
	__IO uint16_t DR16;
	uint16_t      RESERVED19;
	__IO uint16_t DR17;
	uint16_t      RESERVED20;
	__IO uint16_t DR18;
	uint16_t      RESERVED21;
	__IO uint16_t DR19;
	uint16_t      RESERVED22;
	__IO uint16_t DR20;
	uint16_t      RESERVED23;
	__IO uint16_t DR21;
	uint16_t      RESERVED24;
	__IO uint16_t DR22;
	uint16_t      RESERVED25;
	__IO uint16_t DR23;
	uint16_t      RESERVED26;
	__IO uint16_t DR24;
	uint16_t      RESERVED27;
	__IO uint16_t DR25;
	uint16_t      RESERVED28;
	__IO uint16_t DR26;
	uint16_t      RESERVED29;
	__IO uint16_t DR27;
	uint16_t      RESERVED30;
	__IO uint16_t DR28;
	uint16_t      RESERVED31;
	__IO uint16_t DR29;
	uint16_t      RESERVED32;
	__IO uint16_t DR30;
	uint16_t      RESERVED33;
	__IO uint16_t DR31;
	uint16_t      RESERVED34;
	__IO uint16_t DR32;
	uint16_t      RESERVED35;
	__IO uint16_t DR33;
	uint16_t      RESERVED36;
	__IO uint16_t DR34;
	uint16_t      RESERVED37;
	__IO uint16_t DR35;
	uint16_t      RESERVED38;
	__IO uint16_t DR36;
	uint16_t      RESERVED39;
	__IO uint16_t DR37;
	uint16_t      RESERVED40;
	__IO uint16_t DR38;
	uint16_t      RESERVED41;
	__IO uint16_t DR39;
	uint16_t      RESERVED42;
	__IO uint16_t DR40;
	uint16_t      RESERVED43;
	__IO uint16_t DR41;
	uint16_t      RESERVED44;
	__IO uint16_t DR42;
	uint16_t      RESERVED45;
};

/**
 * @brief Controller Area Network TxMailBox
 */

struct CAN_TxMailBox_Type {
	__IO uint32_t TIR;
	__IO uint32_t TDTR;
	__IO uint32_t TDLR;
	__IO uint32_t TDHR;
};

/**
 * @brief Controller Area Network FIFOMailBox
 */

struct CAN_FIFOMailBox_Type {
	__IO uint32_t RIR;
	__IO uint32_t RDTR;
	__IO uint32_t RDLR;
	__IO uint32_t RDHR;
};

/**
 * @brief Controller Area Network FilterRegister
 */

struct CAN_FilterRegister_Type {
	__IO uint32_t FR1;
	__IO uint32_t FR2;
};

/**
 * @brief Controller Area Network
 */

struct CAN_Type {
	__IO uint32_t MCR;
	__IO uint32_t MSR;
	__IO uint32_t TSR;
	__IO uint32_t RF0R;
	__IO uint32_t RF1R;
	__IO uint32_t IER;
	__IO uint32_t ESR;
	__IO uint32_t               BTR;
	uint32_t                    RESERVED0[88];
	struct CAN_TxMailBox_Type   sTxMailBox[3];
	struct CAN_FIFOMailBox_Type sFIFOMailBox[2];
	uint32_t                    RESERVED1[12];
	__IO uint32_t FMR;
	__IO uint32_t FM1R;
	uint32_t      RESERVED2;
	__IO uint32_t FS1R;
	uint32_t      RESERVED3;
	__IO uint32_t FFA1R;
	uint32_t      RESERVED4;
	__IO uint32_t                  FA1R;
	uint32_t                       RESERVED5[8];
	struct CAN_FilterRegister_Type sFilterRegister[14];
};

/**
 * @brief CRC calculation unit
 */

struct CRC_Type {
	__IO uint32_t DR;
	__IO uint8_t IDR;
	uint8_t      RESERVED0;
	uint16_t     RESERVED1;
	__IO uint32_t CR;
};

/**
 * @brief Debug MCU
 */

struct DBGMCU_Type {
	__IO uint32_t IDCODE;
	__IO uint32_t CR;
};

/**
 * @brief DMA Controller
 */

struct DMA_Channel_Type {
	__IO uint32_t CCR;
	__IO uint32_t CNDTR;
	__IO uint32_t CPAR;
	__IO uint32_t CMAR;
};

struct DMA_Type {
	__IO uint32_t ISR;
	__IO uint32_t IFCR;
};

/**
 * @brief External Interrupt/Event Controller
 */

struct EXTI_Type {
	__IO uint32_t IMR;
	__IO uint32_t EMR;
	__IO uint32_t RTSR;
	__IO uint32_t FTSR;
	__IO uint32_t SWIER;
	__IO uint32_t PR;
};

/**
 * @brief FLASH Registers
 */

struct FLASH_Type {
	__IO uint32_t ACR;
	__IO uint32_t KEYR;
	__IO uint32_t OPTKEYR;
	__IO uint32_t SR;
	__IO uint32_t CR;
	__IO uint32_t AR;
	__IO uint32_t RESERVED;
	__IO uint32_t OBR;
	__IO uint32_t WRPR;
};

/**
 * @brief Option Bytes Registers
 */

struct OB_Type {
	__IO uint16_t RDP;
	__IO uint16_t USER;
	__IO uint16_t Data0;
	__IO uint16_t Data1;
	__IO uint16_t WRP0;
	__IO uint16_t WRP1;
	__IO uint16_t WRP2;
	__IO uint16_t WRP3;
};

/**
 * @brief General Purpose I/O
 */

struct GPIO_Type {
	__IO uint32_t CRL;
	__IO uint32_t CRH;
	__IO uint32_t IDR;
	__IO uint32_t ODR;
	__IO uint32_t BSRR;
	__IO uint32_t BRR;
	__IO uint32_t LCKR;
};

/**
 * @brief Alternate Function I/O
 */

struct AFIO_Type {
	__IO uint32_t EVCR;
	__IO uint32_t MAPR;
	__IO uint32_t EXTICR[4];
	uint32_t      RESERVED0;
	__IO uint32_t MAPR2;
};
/**
 * @brief Inter Integrated Circuit Interface
 */

struct I2C_Type {
	__IO uint16_t CR1;
	uint16_t      RESERVED0;
	__IO uint16_t CR2;
	uint16_t      RESERVED1;
	__IO uint16_t OAR1;
	uint16_t      RESERVED2;
	__IO uint16_t OAR2;
	uint16_t      RESERVED3;
	__IO uint16_t DR;
	uint16_t      RESERVED4;
	__IO uint16_t SR1;
	uint16_t      RESERVED5;
	__IO uint16_t SR2;
	uint16_t      RESERVED6;
	__IO uint16_t CCR;
	uint16_t      RESERVED7;
	__IO uint16_t TRISE;
	uint16_t      RESERVED8;
};

/**
 * @brief Independent WATCHDOG
 */

struct IWDG_Type {
	__IO uint32_t KR;
	__IO uint32_t PR;
	__IO uint32_t RLR;
	__IO uint32_t SR;
};

/**
 * @brief Power Control
 */

struct PWR_Type {
	__IO uint32_t CR;
	__IO uint32_t CSR;
};

/**
 * @brief Reset and Clock Control
 */

