daedaleanai/stm32f103_xvcusb/stm32f103_md.h
struct RCC_Type {
	__IO uint32_t CR;
	__IO uint32_t CFGR;
	__IO uint32_t CIR;
	__IO uint32_t APB2RSTR;
	__IO uint32_t APB1RSTR;
	__IO uint32_t AHBENR;
	__IO uint32_t APB2ENR;
	__IO uint32_t APB1ENR;
	__IO uint32_t BDCR;
	__IO uint32_t CSR;
};

/**
 * @brief Real-Time Clock
 */

struct RTC_Type {
	__IO uint16_t CRH;
	uint16_t      RESERVED0;
	__IO uint16_t CRL;
	uint16_t      RESERVED1;
	__IO uint16_t PRLH;
	uint16_t      RESERVED2;
	__IO uint16_t PRLL;
	uint16_t      RESERVED3;
	__IO uint16_t DIVH;
	uint16_t      RESERVED4;
	__IO uint16_t DIVL;
	uint16_t      RESERVED5;
	__IO uint16_t CNTH;
	uint16_t      RESERVED6;
	__IO uint16_t CNTL;
	uint16_t      RESERVED7;
	__IO uint16_t ALRH;
	uint16_t      RESERVED8;
	__IO uint16_t ALRL;
	uint16_t      RESERVED9;
};

/**
 * @brief Serial Peripheral Interface
 */

struct SPI_Type {
	__IO uint16_t CR1;
	uint16_t      RESERVED0;
	__IO uint16_t CR2;
	uint16_t      RESERVED1;
	__IO uint16_t SR;
	uint16_t      RESERVED2;
	__IO uint16_t DR;
	uint16_t      RESERVED3;
	__IO uint16_t CRCPR;
	uint16_t      RESERVED4;
	__IO uint16_t RXCRCR;
	uint16_t      RESERVED5;
	__IO uint16_t TXCRCR;
	uint16_t      RESERVED6;
	__IO uint16_t I2SCFGR;
	uint16_t      RESERVED7;
	__IO uint16_t I2SPR;
	uint16_t      RESERVED8;
};

/**
 * @brief TIM
 */

struct TIM_Type {
	__IO uint16_t CR1;
	uint16_t      RESERVED0;
	__IO uint16_t CR2;
	uint16_t      RESERVED1;
	__IO uint16_t SMCR;
	uint16_t      RESERVED2;
	__IO uint16_t DIER;
	uint16_t      RESERVED3;
	__IO uint16_t SR;
	uint16_t      RESERVED4;
	__IO uint16_t EGR;
	uint16_t      RESERVED5;
	__IO uint16_t CCMR1;
	uint16_t      RESERVED6;
	__IO uint16_t CCMR2;
	uint16_t      RESERVED7;
	__IO uint16_t CCER;
	uint16_t      RESERVED8;
	__IO uint16_t CNT;
	uint16_t      RESERVED9;
	__IO uint16_t PSC;
	uint16_t      RESERVED10;
	__IO uint16_t ARR;
	uint16_t      RESERVED11;
	__IO uint16_t RCR;
	uint16_t      RESERVED12;
	__IO uint16_t CCR1;
	uint16_t      RESERVED13;
	__IO uint16_t CCR2;
	uint16_t      RESERVED14;
	__IO uint16_t CCR3;
	uint16_t      RESERVED15;
	__IO uint16_t CCR4;
	uint16_t      RESERVED16;
	__IO uint16_t BDTR;
	uint16_t      RESERVED17;
	__IO uint16_t DCR;
	uint16_t      RESERVED18;
	__IO uint16_t DMAR;
	uint16_t      RESERVED19;
};

/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

struct USART_Type {
	__IO uint16_t SR;
	uint16_t      RESERVED0;
	__IO uint16_t DR;
	uint16_t      RESERVED1;
	__IO uint16_t BRR;
	uint16_t      RESERVED2;
	__IO uint16_t CR1;
	uint16_t      RESERVED3;
	__IO uint16_t CR2;
	uint16_t      RESERVED4;
	__IO uint16_t CR3;
	uint16_t      RESERVED5;
	__IO uint16_t GTPR;
	uint16_t      RESERVED6;
};

/**
 * @brief Window WATCHDOG
 */

struct WWDG_Type {
	__IO uint32_t CR;
	__IO uint32_t CFR;
	__IO uint32_t SR;
};

/**
 * @}
 */

extern struct ADC_Type         ADC1;
extern struct ADC_Type         ADC2;
extern struct AFIO_Type        AFIO;
extern struct BKP_Type         BKP;
extern struct CAN_Type         CAN1;
extern struct CRC_Type         CRC;
extern struct DMA_Channel_Type DMA1_Channel1;
extern struct DMA_Channel_Type DMA1_Channel2;
extern struct DMA_Channel_Type DMA1_Channel3;
extern struct DMA_Channel_Type DMA1_Channel4;
extern struct DMA_Channel_Type DMA1_Channel5;
extern struct DMA_Channel_Type DMA1_Channel6;
extern struct DMA_Channel_Type DMA1_Channel7;
extern struct DMA_Type         DMA1;
extern struct EXTI_Type        EXTI;
extern struct FLASH_Type       FLASH_R;
extern struct GPIO_Type        GPIOA;
extern struct GPIO_Type        GPIOB;
extern struct GPIO_Type        GPIOC;
extern struct GPIO_Type        GPIOD;
extern struct I2C_Type         I2C1;
extern struct I2C_Type         I2C2;
extern struct IWDG_Type        IWDG;
extern struct OB_Type          OPTION_BYTES;
extern struct PWR_Type         PWR;
extern struct RCC_Type         RCC;
extern struct RTC_Type         RTC;
extern struct SPI_Type         SPI1;
extern struct SPI_Type         SPI2;
extern struct TIM_Type         TIM1;
extern struct TIM_Type         TIM2;
extern struct TIM_Type         TIM3;
extern struct TIM_Type         TIM4;

extern struct USART_Type  USART1;
extern struct USART_Type  USART2;
extern struct USART_Type  USART3;
extern struct WWDG_Type   WWDG;
extern struct DBGMCU_Type DBGMCU;

extern uint32_t UNIQUE_DEVICE_ID[3]; // Section 30.2

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR ((uint32_t)0xFFFFFFFF) /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR ((uint8_t)0xFF) /*!< General-purpose 8-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET ((uint8_t)0x01) /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CR register  ********************/
#define PWR_CR_LPDS ((uint16_t)0x0001) /*!< Low-Power Deepsleep */
#define PWR_CR_PDDS ((uint16_t)0x0002) /*!< Power Down Deepsleep */
#define PWR_CR_CWUF ((uint16_t)0x0004) /*!< Clear Wakeup Flag */
#define PWR_CR_CSBF ((uint16_t)0x0008) /*!< Clear Standby Flag */
#define PWR_CR_PVDE ((uint16_t)0x0010) /*!< Power Voltage Detector Enable */

#define PWR_CR_PLS ((uint16_t)0x00E0)   /*!< PLS[2:0] bits (PVD Level Selection) */

/*!< PVD level configuration */
#define PWR_CR_PLS_2V2 ((uint16_t)0x0000) /*!< PVD level 2.2V */
#define PWR_CR_PLS_2V3 ((uint16_t)0x0020) /*!< PVD level 2.3V */
#define PWR_CR_PLS_2V4 ((uint16_t)0x0040) /*!< PVD level 2.4V */
#define PWR_CR_PLS_2V5 ((uint16_t)0x0060) /*!< PVD level 2.5V */
#define PWR_CR_PLS_2V6 ((uint16_t)0x0080) /*!< PVD level 2.6V */
#define PWR_CR_PLS_2V7 ((uint16_t)0x00A0) /*!< PVD level 2.7V */
#define PWR_CR_PLS_2V8 ((uint16_t)0x00C0) /*!< PVD level 2.8V */
#define PWR_CR_PLS_2V9 ((uint16_t)0x00E0) /*!< PVD level 2.9V */

#define PWR_CR_DBP ((uint16_t)0x0100) /*!< Disable Backup Domain write protection */

/*******************  Bit definition for PWR_CSR register  ********************/
#define PWR_CSR_WUF ((uint16_t)0x0001)  /*!< Wakeup Flag */
#define PWR_CSR_SBF ((uint16_t)0x0002)  /*!< Standby Flag */
#define PWR_CSR_PVDO ((uint16_t)0x0004) /*!< PVD Output */
#define PWR_CSR_EWUP ((uint16_t)0x0100) /*!< Enable WKUP pin */

/******************  Bit definition for BKP_RTCCR register  *******************/
#define BKP_RTCCR_CAL ((uint16_t)0x007F)  /*!< Calibration value */
#define BKP_RTCCR_CCO ((uint16_t)0x0080)  /*!< Calibration Clock Output */
#define BKP_RTCCR_ASOE ((uint16_t)0x0100) /*!< Alarm or Second Output Enable */
#define BKP_RTCCR_ASOS ((uint16_t)0x0200) /*!< Alarm or Second Output Selection */

/********************  Bit definition for BKP_CR register  ********************/
#define BKP_CR_TPE ((uint8_t)0x01)  /*!< TAMPER pin enable */
#define BKP_CR_TPAL ((uint8_t)0x02) /*!< TAMPER pin active level */

/*******************  Bit definition for BKP_CSR register  ********************/
#define BKP_CSR_CTE ((uint16_t)0x0001)  /*!< Clear Tamper event */
#define BKP_CSR_CTI ((uint16_t)0x0002)  /*!< Clear Tamper Interrupt */
#define BKP_CSR_TPIE ((uint16_t)0x0004) /*!< TAMPER Pin interrupt enable */
#define BKP_CSR_TEF ((uint16_t)0x0100)  /*!< Tamper Event Flag */
#define BKP_CSR_TIF ((uint16_t)0x0200)  /*!< Tamper Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_HSION ((uint32_t)0x00000001)   /*!< Internal High Speed clock enable */
#define RCC_CR_HSIRDY ((uint32_t)0x00000002)  /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSITRIM ((uint32_t)0x000000F8) /*!< Internal High Speed clock trimming */
#define RCC_CR_HSICAL ((uint32_t)0x0000FF00)  /*!< Internal High Speed clock Calibration */
#define RCC_CR_HSEON ((uint32_t)0x00010000)   /*!< External High Speed clock enable */
#define RCC_CR_HSERDY ((uint32_t)0x00020000)  /*!< External High Speed clock ready flag */
#define RCC_CR_HSEBYP ((uint32_t)0x00040000)  /*!< External High Speed clock Bypass */
#define RCC_CR_CSSON ((uint32_t)0x00080000)   /*!< Clock Security System enable */
#define RCC_CR_PLLON ((uint32_t)0x01000000)   /*!< PLL enable */
#define RCC_CR_PLLRDY ((uint32_t)0x02000000)  /*!< PLL clock ready flag */

/*******************  Bit definition for RCC_CFGR register  *******************/
/*!< SW configuration */
#define RCC_CFGR_SW ((uint32_t)0x00000003)   /*!< SW[1:0] bits (System clock Switch) */
#define RCC_CFGR_SW_HSI ((uint32_t)0x00000000) /*!< HSI selected as system clock */
#define RCC_CFGR_SW_HSE ((uint32_t)0x00000001) /*!< HSE selected as system clock */
#define RCC_CFGR_SW_PLL ((uint32_t)0x00000002) /*!< PLL selected as system clock */

/*!< SWS configuration */
#define RCC_CFGR_SWS ((uint32_t)0x0000000C)   /*!< SWS[1:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_HSI ((uint32_t)0x00000000) /*!< HSI oscillator used as system clock */
#define RCC_CFGR_SWS_HSE ((uint32_t)0x00000004) /*!< HSE oscillator used as system clock */
#define RCC_CFGR_SWS_PLL ((uint32_t)0x00000008) /*!< PLL used as system clock */

