daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/*****************  Bit definition for RCC_APB2RSTR register  *****************/
#define RCC_APB2RSTR_AFIORST ((uint32_t)0x00000001)   /*!< Alternate Function I/O reset */
#define RCC_APB2RSTR_IOPARST ((uint32_t)0x00000004)   /*!< I/O port A reset */
#define RCC_APB2RSTR_IOPBRST ((uint32_t)0x00000008)   /*!< I/O port B reset */
#define RCC_APB2RSTR_IOPCRST ((uint32_t)0x00000010)   /*!< I/O port C reset */
#define RCC_APB2RSTR_IOPDRST ((uint32_t)0x00000020)   /*!< I/O port D reset */
#define RCC_APB2RSTR_ADC1RST ((uint32_t)0x00000200)   /*!< ADC 1 interface reset */
#define RCC_APB2RSTR_ADC2RST ((uint32_t)0x00000400)   /*!< ADC 2 interface reset */
#define RCC_APB2RSTR_TIM1RST ((uint32_t)0x00000800)   /*!< TIM1 Timer reset */
#define RCC_APB2RSTR_SPI1RST ((uint32_t)0x00001000)   /*!< SPI 1 reset */
#define RCC_APB2RSTR_USART1RST ((uint32_t)0x00004000) /*!< USART1 reset */
#define RCC_APB2RSTR_IOPERST ((uint32_t)0x00000040)   /*!< I/O port E reset */

/*****************  Bit definition for RCC_APB1RSTR register  *****************/
#define RCC_APB1RSTR_TIM2RST ((uint32_t)0x00000001)   /*!< Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST ((uint32_t)0x00000002)   /*!< Timer 3 reset */
#define RCC_APB1RSTR_WWDGRST ((uint32_t)0x00000800)   /*!< Window Watchdog reset */
#define RCC_APB1RSTR_USART2RST ((uint32_t)0x00020000) /*!< USART 2 reset */
#define RCC_APB1RSTR_I2C1RST ((uint32_t)0x00200000)   /*!< I2C 1 reset */
#define RCC_APB1RSTR_CAN1RST ((uint32_t)0x02000000)   /*!< CAN1 reset */
#define RCC_APB1RSTR_BKPRST ((uint32_t)0x08000000)    /*!< Backup interface reset */
#define RCC_APB1RSTR_PWRRST ((uint32_t)0x10000000)    /*!< Power interface reset */
#define RCC_APB1RSTR_TIM4RST ((uint32_t)0x00000004)   /*!< Timer 4 reset */
#define RCC_APB1RSTR_SPI2RST ((uint32_t)0x00004000)   /*!< SPI 2 reset */
#define RCC_APB1RSTR_USART3RST ((uint32_t)0x00040000) /*!< USART 3 reset */
#define RCC_APB1RSTR_I2C2RST ((uint32_t)0x00400000)   /*!< I2C 2 reset */
#define RCC_APB1RSTR_USBRST ((uint32_t)0x00800000)    /*!< USB Device reset */

/******************  Bit definition for RCC_AHBENR register  ******************/
#define RCC_AHBENR_DMA1EN ((uint16_t)0x0001)  /*!< DMA1 clock enable */
#define RCC_AHBENR_SRAMEN ((uint16_t)0x0004)  /*!< SRAM interface clock enable */
#define RCC_AHBENR_FLITFEN ((uint16_t)0x0010) /*!< FLITF clock enable */
#define RCC_AHBENR_CRCEN ((uint16_t)0x0040)   /*!< CRC clock enable */

/******************  Bit definition for RCC_APB2ENR register  *****************/
#define RCC_APB2ENR_AFIOEN ((uint32_t)0x00000001)   /*!< Alternate Function I/O clock enable */
#define RCC_APB2ENR_IOPAEN ((uint32_t)0x00000004)   /*!< I/O port A clock enable */
#define RCC_APB2ENR_IOPBEN ((uint32_t)0x00000008)   /*!< I/O port B clock enable */
#define RCC_APB2ENR_IOPCEN ((uint32_t)0x00000010)   /*!< I/O port C clock enable */
#define RCC_APB2ENR_IOPDEN ((uint32_t)0x00000020)   /*!< I/O port D clock enable */
#define RCC_APB2ENR_ADC1EN ((uint32_t)0x00000200)   /*!< ADC 1 interface clock enable */
#define RCC_APB2ENR_ADC2EN ((uint32_t)0x00000400)   /*!< ADC 2 interface clock enable */
#define RCC_APB2ENR_TIM1EN ((uint32_t)0x00000800)   /*!< TIM1 Timer clock enable */
#define RCC_APB2ENR_SPI1EN ((uint32_t)0x00001000)   /*!< SPI 1 clock enable */
#define RCC_APB2ENR_USART1EN ((uint32_t)0x00004000) /*!< USART1 clock enable */
#define RCC_APB2ENR_IOPEEN ((uint32_t)0x00000040)   /*!< I/O port E clock enable */

/*****************  Bit definition for RCC_APB1ENR register  ******************/
#define RCC_APB1ENR_TIM2EN ((uint32_t)0x00000001)   /*!< Timer 2 clock enabled*/
#define RCC_APB1ENR_TIM3EN ((uint32_t)0x00000002)   /*!< Timer 3 clock enable */
#define RCC_APB1ENR_WWDGEN ((uint32_t)0x00000800)   /*!< Window Watchdog clock enable */
#define RCC_APB1ENR_USART2EN ((uint32_t)0x00020000) /*!< USART 2 clock enable */
#define RCC_APB1ENR_I2C1EN ((uint32_t)0x00200000)   /*!< I2C 1 clock enable */
#define RCC_APB1ENR_CAN1EN ((uint32_t)0x02000000)   /*!< CAN1 clock enable */
#define RCC_APB1ENR_BKPEN ((uint32_t)0x08000000)    /*!< Backup interface clock enable */
#define RCC_APB1ENR_PWREN ((uint32_t)0x10000000)    /*!< Power interface clock enable */
#define RCC_APB1ENR_TIM4EN ((uint32_t)0x00000004)   /*!< Timer 4 clock enable */
#define RCC_APB1ENR_SPI2EN ((uint32_t)0x00004000)   /*!< SPI 2 clock enable */
#define RCC_APB1ENR_USART3EN ((uint32_t)0x00040000) /*!< USART 3 clock enable */
#define RCC_APB1ENR_I2C2EN ((uint32_t)0x00400000)   /*!< I2C 2 clock enable */
#define RCC_APB1ENR_USBEN ((uint32_t)0x00800000)    /*!< USB Device clock enable */

/*******************  Bit definition for RCC_BDCR register  *******************/
#define RCC_BDCR_LSEON ((uint32_t)0x00000001)    /*!< External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY ((uint32_t)0x00000002)   /*!< External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP ((uint32_t)0x00000004)   /*!< External Low Speed oscillator Bypass */
#define RCC_BDCR_RTCSEL ((uint32_t)0x00000300)   /*!< RTCSEL[1:0] bits (RTC clock source selection) */
/*!< RTC congiguration */
#define RCC_BDCR_RTCSEL_NOCLOCK ((uint32_t)0x00000000) /*!< No clock */
#define RCC_BDCR_RTCSEL_LSE ((uint32_t)0x00000100)     /*!< LSE oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_LSI ((uint32_t)0x00000200)     /*!< LSI oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_HSE ((uint32_t)0x00000300)     /*!< HSE oscillator clock divided by 128 used as RTC clock */

#define RCC_BDCR_RTCEN ((uint32_t)0x00008000)          /*!< RTC clock enable */
#define RCC_BDCR_BDRST ((uint32_t)0x00010000)          /*!< Backup domain software reset  */

/*******************  Bit definition for RCC_CSR register  ********************/
#define RCC_CSR_LSION ((uint32_t)0x00000001)    /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY ((uint32_t)0x00000002)   /*!< Internal Low Speed oscillator Ready */
#define RCC_CSR_RMVF ((uint32_t)0x01000000)     /*!< Remove reset flag */
#define RCC_CSR_PINRSTF ((uint32_t)0x04000000)  /*!< PIN reset flag */
#define RCC_CSR_PORRSTF ((uint32_t)0x08000000)  /*!< POR/PDR reset flag */
#define RCC_CSR_SFTRSTF ((uint32_t)0x10000000)  /*!< Software Reset flag */
#define RCC_CSR_IWDGRSTF ((uint32_t)0x20000000) /*!< Independent Watchdog reset flag */
#define RCC_CSR_WWDGRSTF ((uint32_t)0x40000000) /*!< Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF ((uint32_t)0x80000000) /*!< Low-Power reset flag */

/******************************************************************************/
/*                                                                            */
/*                General Purpose and Alternate Function I/O                  */
/*                                                                            */
/******************************************************************************/


/******************  Bit definition for AFIO_EVCR register  *******************/
#define AFIO_EVCR_PIN ((uint8_t)0x0F)   /*!< PIN[3:0] bits (Pin selection) */
#define AFIO_EVCR_PIN_PX0 ((uint8_t)0x00)  /*!< Pin 0 selected */
#define AFIO_EVCR_PIN_PX1 ((uint8_t)0x01)  /*!< Pin 1 selected */
#define AFIO_EVCR_PIN_PX2 ((uint8_t)0x02)  /*!< Pin 2 selected */
#define AFIO_EVCR_PIN_PX3 ((uint8_t)0x03)  /*!< Pin 3 selected */
#define AFIO_EVCR_PIN_PX4 ((uint8_t)0x04)  /*!< Pin 4 selected */
#define AFIO_EVCR_PIN_PX5 ((uint8_t)0x05)  /*!< Pin 5 selected */
#define AFIO_EVCR_PIN_PX6 ((uint8_t)0x06)  /*!< Pin 6 selected */
#define AFIO_EVCR_PIN_PX7 ((uint8_t)0x07)  /*!< Pin 7 selected */
#define AFIO_EVCR_PIN_PX8 ((uint8_t)0x08)  /*!< Pin 8 selected */
#define AFIO_EVCR_PIN_PX9 ((uint8_t)0x09)  /*!< Pin 9 selected */
#define AFIO_EVCR_PIN_PX10 ((uint8_t)0x0A) /*!< Pin 10 selected */
#define AFIO_EVCR_PIN_PX11 ((uint8_t)0x0B) /*!< Pin 11 selected */
#define AFIO_EVCR_PIN_PX12 ((uint8_t)0x0C) /*!< Pin 12 selected */
#define AFIO_EVCR_PIN_PX13 ((uint8_t)0x0D) /*!< Pin 13 selected */
#define AFIO_EVCR_PIN_PX14 ((uint8_t)0x0E) /*!< Pin 14 selected */
#define AFIO_EVCR_PIN_PX15 ((uint8_t)0x0F) /*!< Pin 15 selected */

