daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/******************  Bit definition for DMA_CNDTR6 register  ******************/
#define DMA_CNDTR6_NDT ((uint16_t)0xFFFF) /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CNDTR7 register  ******************/
#define DMA_CNDTR7_NDT ((uint16_t)0xFFFF) /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CPAR1 register  *******************/
#define DMA_CPAR1_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR2 register  *******************/
#define DMA_CPAR2_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR3 register  *******************/
#define DMA_CPAR3_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR4 register  *******************/
#define DMA_CPAR4_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR5 register  *******************/
#define DMA_CPAR5_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR6 register  *******************/
#define DMA_CPAR6_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CPAR7 register  *******************/
#define DMA_CPAR7_PA ((uint32_t)0xFFFFFFFF) /*!< Peripheral Address */

/******************  Bit definition for DMA_CMAR1 register  *******************/
#define DMA_CMAR1_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR2 register  *******************/
#define DMA_CMAR2_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR3 register  *******************/
#define DMA_CMAR3_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR4 register  *******************/
#define DMA_CMAR4_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR5 register  *******************/
#define DMA_CMAR5_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR6 register  *******************/
#define DMA_CMAR6_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************  Bit definition for DMA_CMAR7 register  *******************/
#define DMA_CMAR7_MA ((uint32_t)0xFFFFFFFF) /*!< Memory Address */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ADC_SR register  ********************/
#define ADC_SR_AWD ((uint8_t)0x01)   /*!< Analog watchdog flag */
#define ADC_SR_EOC ((uint8_t)0x02)   /*!< End of conversion */
#define ADC_SR_JEOC ((uint8_t)0x04)  /*!< Injected channel end of conversion */
#define ADC_SR_JSTRT ((uint8_t)0x08) /*!< Injected channel Start flag */
#define ADC_SR_STRT ((uint8_t)0x10)  /*!< Regular channel Start flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define ADC_CR1_AWDCH ((uint32_t)0x0000001F)   /*!< AWDCH[4:0] bits (Analog watchdog channel select bits) */

#define ADC_CR1_EOCIE ((uint32_t)0x00000020)   /*!< Interrupt enable for EOC */
#define ADC_CR1_AWDIE ((uint32_t)0x00000040)   /*!< Analog Watchdog interrupt enable */
#define ADC_CR1_JEOCIE ((uint32_t)0x00000080)  /*!< Interrupt enable for injected channels */
#define ADC_CR1_SCAN ((uint32_t)0x00000100)    /*!< Scan mode */
#define ADC_CR1_AWDSGL ((uint32_t)0x00000200)  /*!< Enable the watchdog on a single channel in scan mode */
#define ADC_CR1_JAUTO ((uint32_t)0x00000400)   /*!< Automatic injected group conversion */
#define ADC_CR1_DISCEN ((uint32_t)0x00000800)  /*!< Discontinuous mode on regular channels */
#define ADC_CR1_JDISCEN ((uint32_t)0x00001000) /*!< Discontinuous mode on injected channels */

#define ADC_CR1_DISCNUM ((uint32_t)0x0000E000)   /*!< DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CR1_DUALMOD ((uint32_t)0x000F0000)   /*!< DUALMOD[3:0] bits (Dual mode selection) */
#define ADC_CR1_JAWDEN ((uint32_t)0x00400000) /*!< Analog watchdog enable on injected channels */
#define ADC_CR1_AWDEN ((uint32_t)0x00800000)  /*!< Analog watchdog enable on regular channels */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define ADC_CR2_ADON ((uint32_t)0x00000001)   /*!< A/D Converter ON / OFF */
#define ADC_CR2_CONT ((uint32_t)0x00000002)   /*!< Continuous Conversion */
#define ADC_CR2_CAL ((uint32_t)0x00000004)    /*!< A/D Calibration */
#define ADC_CR2_RSTCAL ((uint32_t)0x00000008) /*!< Reset Calibration */
#define ADC_CR2_DMA ((uint32_t)0x00000100)    /*!< Direct Memory access mode */
#define ADC_CR2_ALIGN ((uint32_t)0x00000800)  /*!< Data Alignment */

#define ADC_CR2_JEXTSEL ((uint32_t)0x00007000)   /*!< JEXTSEL[2:0] bits (External event select for injected group) */
#define ADC_CR2_JEXTTRIG ((uint32_t)0x00008000) /*!< External Trigger Conversion mode for injected channels */

#define ADC_CR2_EXTSEL ((uint32_t)0x000E0000)   /*!< EXTSEL[2:0] bits (External Event Select for regular group) */
#define ADC_CR2_EXTTRIG ((uint32_t)0x00100000)  /*!< External Trigger Conversion mode for regular channels */
#define ADC_CR2_JSWSTART ((uint32_t)0x00200000) /*!< Start Conversion of injected channels */
#define ADC_CR2_SWSTART ((uint32_t)0x00400000)  /*!< Start Conversion of regular channels */
#define ADC_CR2_TSVREFE ((uint32_t)0x00800000)  /*!< Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define ADC_SMPR1_SMP10 ((uint32_t)0x00000007)   /*!< SMP10[2:0] bits (Channel 10 Sample time selection) */
#define ADC_SMPR1_SMP11 ((uint32_t)0x00000038)   /*!< SMP11[2:0] bits (Channel 11 Sample time selection) */
#define ADC_SMPR1_SMP12 ((uint32_t)0x000001C0)   /*!< SMP12[2:0] bits (Channel 12 Sample time selection) */
#define ADC_SMPR1_SMP13 ((uint32_t)0x00000E00)   /*!< SMP13[2:0] bits (Channel 13 Sample time selection) */
#define ADC_SMPR1_SMP14 ((uint32_t)0x00007000)   /*!< SMP14[2:0] bits (Channel 14 Sample time selection) */
#define ADC_SMPR1_SMP15 ((uint32_t)0x00038000)   /*!< SMP15[2:0] bits (Channel 15 Sample time selection) */
#define ADC_SMPR1_SMP16 ((uint32_t)0x001C0000)   /*!< SMP16[2:0] bits (Channel 16 Sample time selection) */
#define ADC_SMPR1_SMP17 ((uint32_t)0x00E00000)   /*!< SMP17[2:0] bits (Channel 17 Sample time selection) */

