daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/******************  Bit definition for ADC_SMPR2 register  *******************/
#define ADC_SMPR2_SMP0 ((uint32_t)0x00000007)   /*!< SMP0[2:0] bits (Channel 0 Sample time selection) */
#define ADC_SMPR2_SMP1 ((uint32_t)0x00000038)   /*!< SMP1[2:0] bits (Channel 1 Sample time selection) */
#define ADC_SMPR2_SMP2 ((uint32_t)0x000001C0)   /*!< SMP2[2:0] bits (Channel 2 Sample time selection) */
#define ADC_SMPR2_SMP3 ((uint32_t)0x00000E00)   /*!< SMP3[2:0] bits (Channel 3 Sample time selection) */
#define ADC_SMPR2_SMP4 ((uint32_t)0x00007000)   /*!< SMP4[2:0] bits (Channel 4 Sample time selection) */
#define ADC_SMPR2_SMP5 ((uint32_t)0x00038000)   /*!< SMP5[2:0] bits (Channel 5 Sample time selection) */
#define ADC_SMPR2_SMP6 ((uint32_t)0x001C0000)   /*!< SMP6[2:0] bits (Channel 6 Sample time selection) */
#define ADC_SMPR2_SMP7 ((uint32_t)0x00E00000)   /*!< SMP7[2:0] bits (Channel 7 Sample time selection) */
#define ADC_SMPR2_SMP8 ((uint32_t)0x07000000)   /*!< SMP8[2:0] bits (Channel 8 Sample time selection) */
#define ADC_SMPR2_SMP9 ((uint32_t)0x38000000)   /*!< SMP9[2:0] bits (Channel 9 Sample time selection) */

/******************  Bit definition for ADC_JOFR1 register  *******************/
#define ADC_JOFR1_JOFFSET1 ((uint16_t)0x0FFF) /*!< Data offset for injected channel 1 */

/******************  Bit definition for ADC_JOFR2 register  *******************/
#define ADC_JOFR2_JOFFSET2 ((uint16_t)0x0FFF) /*!< Data offset for injected channel 2 */

/******************  Bit definition for ADC_JOFR3 register  *******************/
#define ADC_JOFR3_JOFFSET3 ((uint16_t)0x0FFF) /*!< Data offset for injected channel 3 */

/******************  Bit definition for ADC_JOFR4 register  *******************/
#define ADC_JOFR4_JOFFSET4 ((uint16_t)0x0FFF) /*!< Data offset for injected channel 4 */

/*******************  Bit definition for ADC_HTR register  ********************/
#define ADC_HTR_HT ((uint16_t)0x0FFF) /*!< Analog watchdog high threshold */

/*******************  Bit definition for ADC_LTR register  ********************/
#define ADC_LTR_LT ((uint16_t)0x0FFF) /*!< Analog watchdog low threshold */

/*******************  Bit definition for ADC_SQR1 register  *******************/
#define ADC_SQR1_SQ13 ((uint32_t)0x0000001F)   /*!< SQ13[4:0] bits (13th conversion in regular sequence) */
#define ADC_SQR1_SQ14 ((uint32_t)0x000003E0)   /*!< SQ14[4:0] bits (14th conversion in regular sequence) */
#define ADC_SQR1_SQ15 ((uint32_t)0x00007C00)   /*!< SQ15[4:0] bits (15th conversion in regular sequence) */
#define ADC_SQR1_SQ16 ((uint32_t)0x000F8000)   /*!< SQ16[4:0] bits (16th conversion in regular sequence) */
#define ADC_SQR1_L ((uint32_t)0x00F00000)   /*!< L[3:0] bits (Regular channel sequence length) */

/*******************  Bit definition for ADC_SQR2 register  *******************/
#define ADC_SQR2_SQ7 ((uint32_t)0x0000001F)   /*!< SQ7[4:0] bits (7th conversion in regular sequence) */
#define ADC_SQR2_SQ8 ((uint32_t)0x000003E0)   /*!< SQ8[4:0] bits (8th conversion in regular sequence) */
#define ADC_SQR2_SQ9 ((uint32_t)0x00007C00)   /*!< SQ9[4:0] bits (9th conversion in regular sequence) */

#define ADC_SQR2_SQ10 ((uint32_t)0x000F8000)   /*!< SQ10[4:0] bits (10th conversion in regular sequence) */
#define ADC_SQR2_SQ11 ((uint32_t)0x01F00000)   /*!< SQ11[4:0] bits (11th conversion in regular sequence) */
#define ADC_SQR2_SQ12 ((uint32_t)0x3E000000)   /*!< SQ12[4:0] bits (12th conversion in regular sequence) */

/*******************  Bit definition for ADC_SQR3 register  *******************/
#define ADC_SQR3_SQ1 ((uint32_t)0x0000001F)   /*!< SQ1[4:0] bits (1st conversion in regular sequence) */
#define ADC_SQR3_SQ2 ((uint32_t)0x000003E0)   /*!< SQ2[4:0] bits (2nd conversion in regular sequence) */
#define ADC_SQR3_SQ3 ((uint32_t)0x00007C00)   /*!< SQ3[4:0] bits (3rd conversion in regular sequence) */
#define ADC_SQR3_SQ4 ((uint32_t)0x000F8000)   /*!< SQ4[4:0] bits (4th conversion in regular sequence) */
#define ADC_SQR3_SQ5 ((uint32_t)0x01F00000)   /*!< SQ5[4:0] bits (5th conversion in regular sequence) */
#define ADC_SQR3_SQ6 ((uint32_t)0x3E000000)   /*!< SQ6[4:0] bits (6th conversion in regular sequence) */

/*******************  Bit definition for ADC_JSQR register  *******************/
#define ADC_JSQR_JSQ1 ((uint32_t)0x0000001F)   /*!< JSQ1[4:0] bits (1st conversion in injected sequence) */
#define ADC_JSQR_JSQ2 ((uint32_t)0x000003E0)   /*!< JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define ADC_JSQR_JSQ3 ((uint32_t)0x00007C00)   /*!< JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define ADC_JSQR_JSQ4 ((uint32_t)0x000F8000)   /*!< JSQ4[4:0] bits (4th conversion in injected sequence) */
#define ADC_JSQR_JL ((uint32_t)0x00300000)   /*!< JL[1:0] bits (Injected Sequence length) */

/*******************  Bit definition for ADC_JDR1 register  *******************/
#define ADC_JDR1_JDATA ((uint16_t)0xFFFF) /*!< Injected data */

/*******************  Bit definition for ADC_JDR2 register  *******************/
#define ADC_JDR2_JDATA ((uint16_t)0xFFFF) /*!< Injected data */

/*******************  Bit definition for ADC_JDR3 register  *******************/
#define ADC_JDR3_JDATA ((uint16_t)0xFFFF) /*!< Injected data */

/*******************  Bit definition for ADC_JDR4 register  *******************/
#define ADC_JDR4_JDATA ((uint16_t)0xFFFF) /*!< Injected data */

/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA ((uint32_t)0x0000FFFF)     /*!< Regular data */
#define ADC_DR_ADC2DATA ((uint32_t)0xFFFF0000) /*!< ADC2 data */

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for TIM_CR1 register  ********************/
#define TIM_CR1_CEN ((uint16_t)0x0001)  /*!< Counter enable */
#define TIM_CR1_UDIS ((uint16_t)0x0002) /*!< Update disable */
#define TIM_CR1_URS ((uint16_t)0x0004)  /*!< Update request source */
#define TIM_CR1_OPM ((uint16_t)0x0008)  /*!< One pulse mode */
#define TIM_CR1_DIR ((uint16_t)0x0010)  /*!< Direction */

