daedaleanai/stm32f103_xvcusb/stm32f103_md.h
#define TIM_CR1_CMS ((uint16_t)0x0060)   /*!< CMS[1:0] bits (Center-aligned mode selection) */
#define TIM_CR1_ARPE ((uint16_t)0x0080) /*!< Auto-reload preload enable */

#define TIM_CR1_CKD ((uint16_t)0x0300)   /*!< CKD[1:0] bits (clock division) */

/*******************  Bit definition for TIM_CR2 register  ********************/
#define TIM_CR2_CCPC ((uint16_t)0x0001) /*!< Capture/Compare Preloaded Control */
#define TIM_CR2_CCUS ((uint16_t)0x0004) /*!< Capture/Compare Control Update Selection */
#define TIM_CR2_CCDS ((uint16_t)0x0008) /*!< Capture/Compare DMA Selection */

#define TIM_CR2_MMS ((uint16_t)0x0070)   /*!< MMS[2:0] bits (Master Mode Selection) */

#define TIM_CR2_TI1S ((uint16_t)0x0080)  /*!< TI1 Selection */
#define TIM_CR2_OIS1 ((uint16_t)0x0100)  /*!< Output Idle state 1 (OC1 output) */
#define TIM_CR2_OIS1N ((uint16_t)0x0200) /*!< Output Idle state 1 (OC1N output) */
#define TIM_CR2_OIS2 ((uint16_t)0x0400)  /*!< Output Idle state 2 (OC2 output) */
#define TIM_CR2_OIS2N ((uint16_t)0x0800) /*!< Output Idle state 2 (OC2N output) */
#define TIM_CR2_OIS3 ((uint16_t)0x1000)  /*!< Output Idle state 3 (OC3 output) */
#define TIM_CR2_OIS3N ((uint16_t)0x2000) /*!< Output Idle state 3 (OC3N output) */
#define TIM_CR2_OIS4 ((uint16_t)0x4000)  /*!< Output Idle state 4 (OC4 output) */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define TIM_SMCR_SMS ((uint16_t)0x0007)   /*!< SMS[2:0] bits (Slave mode selection) */
#define TIM_SMCR_TS ((uint16_t)0x0070)   /*!< TS[2:0] bits (Trigger selection) */
#define TIM_SMCR_MSM ((uint16_t)0x0080) /*!< Master/slave mode */

#define TIM_SMCR_ETF ((uint16_t)0x0F00)   /*!< ETF[3:0] bits (External trigger filter) */
#define TIM_SMCR_ETPS ((uint16_t)0x3000)   /*!< ETPS[1:0] bits (External trigger prescaler) */

#define TIM_SMCR_ECE ((uint16_t)0x4000) /*!< External clock enable */
#define TIM_SMCR_ETP ((uint16_t)0x8000) /*!< External trigger polarity */

/*******************  Bit definition for TIM_DIER register  *******************/
#define TIM_DIER_UIE ((uint16_t)0x0001)   /*!< Update interrupt enable */
#define TIM_DIER_CC1IE ((uint16_t)0x0002) /*!< Capture/Compare 1 interrupt enable */
#define TIM_DIER_CC2IE ((uint16_t)0x0004) /*!< Capture/Compare 2 interrupt enable */
#define TIM_DIER_CC3IE ((uint16_t)0x0008) /*!< Capture/Compare 3 interrupt enable */
#define TIM_DIER_CC4IE ((uint16_t)0x0010) /*!< Capture/Compare 4 interrupt enable */
#define TIM_DIER_COMIE ((uint16_t)0x0020) /*!< COM interrupt enable */
#define TIM_DIER_TIE ((uint16_t)0x0040)   /*!< Trigger interrupt enable */
#define TIM_DIER_BIE ((uint16_t)0x0080)   /*!< Break interrupt enable */
#define TIM_DIER_UDE ((uint16_t)0x0100)   /*!< Update DMA request enable */
#define TIM_DIER_CC1DE ((uint16_t)0x0200) /*!< Capture/Compare 1 DMA request enable */
#define TIM_DIER_CC2DE ((uint16_t)0x0400) /*!< Capture/Compare 2 DMA request enable */
#define TIM_DIER_CC3DE ((uint16_t)0x0800) /*!< Capture/Compare 3 DMA request enable */
#define TIM_DIER_CC4DE ((uint16_t)0x1000) /*!< Capture/Compare 4 DMA request enable */
#define TIM_DIER_COMDE ((uint16_t)0x2000) /*!< COM DMA request enable */
#define TIM_DIER_TDE ((uint16_t)0x4000)   /*!< Trigger DMA request enable */

/********************  Bit definition for TIM_SR register  ********************/
#define TIM_SR_UIF ((uint16_t)0x0001)   /*!< Update interrupt Flag */
#define TIM_SR_CC1IF ((uint16_t)0x0002) /*!< Capture/Compare 1 interrupt Flag */
#define TIM_SR_CC2IF ((uint16_t)0x0004) /*!< Capture/Compare 2 interrupt Flag */
#define TIM_SR_CC3IF ((uint16_t)0x0008) /*!< Capture/Compare 3 interrupt Flag */
#define TIM_SR_CC4IF ((uint16_t)0x0010) /*!< Capture/Compare 4 interrupt Flag */
#define TIM_SR_COMIF ((uint16_t)0x0020) /*!< COM interrupt Flag */
#define TIM_SR_TIF ((uint16_t)0x0040)   /*!< Trigger interrupt Flag */
#define TIM_SR_BIF ((uint16_t)0x0080)   /*!< Break interrupt Flag */
#define TIM_SR_CC1OF ((uint16_t)0x0200) /*!< Capture/Compare 1 Overcapture Flag */
#define TIM_SR_CC2OF ((uint16_t)0x0400) /*!< Capture/Compare 2 Overcapture Flag */
#define TIM_SR_CC3OF ((uint16_t)0x0800) /*!< Capture/Compare 3 Overcapture Flag */
#define TIM_SR_CC4OF ((uint16_t)0x1000) /*!< Capture/Compare 4 Overcapture Flag */

/*******************  Bit definition for TIM_EGR register  ********************/
#define TIM_EGR_UG ((uint8_t)0x01)   /*!< Update Generation */
#define TIM_EGR_CC1G ((uint8_t)0x02) /*!< Capture/Compare 1 Generation */
#define TIM_EGR_CC2G ((uint8_t)0x04) /*!< Capture/Compare 2 Generation */
#define TIM_EGR_CC3G ((uint8_t)0x08) /*!< Capture/Compare 3 Generation */
#define TIM_EGR_CC4G ((uint8_t)0x10) /*!< Capture/Compare 4 Generation */
#define TIM_EGR_COMG ((uint8_t)0x20) /*!< Capture/Compare Control Update Generation */
#define TIM_EGR_TG ((uint8_t)0x40)   /*!< Trigger Generation */
#define TIM_EGR_BG ((uint8_t)0x80)   /*!< Break Generation */

/******************  Bit definition for TIM_CCMR1 register  *******************/
#define TIM_CCMR1_CC1S ((uint16_t)0x0003)   /*!< CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM_CCMR1_OC1FE ((uint16_t)0x0004) /*!< Output Compare 1 Fast enable */
#define TIM_CCMR1_OC1PE ((uint16_t)0x0008) /*!< Output Compare 1 Preload enable */
#define TIM_CCMR1_OC1M ((uint16_t)0x0070)   /*!< OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM_CCMR1_OC1CE ((uint16_t)0x0080) /*!< Output Compare 1Clear Enable */
#define TIM_CCMR1_CC2S ((uint16_t)0x0300)   /*!< CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM_CCMR1_OC2FE ((uint16_t)0x0400) /*!< Output Compare 2 Fast enable */
#define TIM_CCMR1_OC2PE ((uint16_t)0x0800) /*!< Output Compare 2 Preload enable */
#define TIM_CCMR1_OC2M ((uint16_t)0x7000)   /*!< OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM_CCMR1_OC2CE ((uint16_t)0x8000) /*!< Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/

#define TIM_CCMR1_IC1PSC ((uint16_t)0x000C)   /*!< IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM_CCMR1_IC1F ((uint16_t)0x00F0)   /*!< IC1F[3:0] bits (Input Capture 1 Filter) */
#define TIM_CCMR1_IC2PSC ((uint16_t)0x0C00)   /*!< IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define TIM_CCMR1_IC2F ((uint16_t)0xF000)   /*!< IC2F[3:0] bits (Input Capture 2 Filter) */

/******************  Bit definition for TIM_CCMR2 register  *******************/
#define TIM_CCMR2_CC3S ((uint16_t)0x0003)   /*!< CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define TIM_CCMR2_OC3FE ((uint16_t)0x0004) /*!< Output Compare 3 Fast enable */
#define TIM_CCMR2_OC3PE ((uint16_t)0x0008) /*!< Output Compare 3 Preload enable */
#define TIM_CCMR2_OC3M ((uint16_t)0x0070)   /*!< OC3M[2:0] bits (Output Compare 3 Mode) */
#define TIM_CCMR2_OC3CE ((uint16_t)0x0080) /*!< Output Compare 3 Clear Enable */
#define TIM_CCMR2_CC4S ((uint16_t)0x0300)   /*!< CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TIM_CCMR2_OC4FE ((uint16_t)0x0400) /*!< Output Compare 4 Fast enable */
#define TIM_CCMR2_OC4PE ((uint16_t)0x0800) /*!< Output Compare 4 Preload enable */
#define TIM_CCMR2_OC4M ((uint16_t)0x7000)   /*!< OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR2_OC4CE ((uint16_t)0x8000) /*!< Output Compare 4 Clear Enable */

