daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/*******************  Bit definition for RTC_ALRL register  *******************/
#define RTC_ALRL_RTC_ALR ((uint16_t)0xFFFF) /*!< RTC Alarm Low */

/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY ((uint16_t)0xFFFF) /*!< Key value (write only, read 0000h) */

/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR ((uint8_t)0x07)   /*!< PR[2:0] (Prescaler divider) */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL ((uint16_t)0x0FFF) /*!< Watchdog counter reload value */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU ((uint8_t)0x01) /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU ((uint8_t)0x02) /*!< Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WWDG_CR register  ********************/
#define WWDG_CR_T ((uint8_t)0x7F)  /*!< T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CR_WDGA ((uint8_t)0x80) /*!< Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W ((uint16_t)0x007F)  /*!< W[6:0] bits (7-bit window value) */
#define WWDG_CFR_WDGTB ((uint16_t)0x0180)  /*!< WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFR_EWI ((uint16_t)0x0200) /*!< Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF ((uint8_t)0x01) /*!< Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                         Controller Area Network                            */
/*                                                                            */
/******************************************************************************/

/*!< CAN control and status registers */
/*******************  Bit definition for CAN_MCR register  ********************/
#define CAN_MCR_INRQ ((uint16_t)0x0001)  /*!< Initialization Request */
#define CAN_MCR_SLEEP ((uint16_t)0x0002) /*!< Sleep Mode Request */
#define CAN_MCR_TXFP ((uint16_t)0x0004)  /*!< Transmit FIFO Priority */
#define CAN_MCR_RFLM ((uint16_t)0x0008)  /*!< Receive FIFO Locked Mode */
#define CAN_MCR_NART ((uint16_t)0x0010)  /*!< No Automatic Retransmission */
#define CAN_MCR_AWUM ((uint16_t)0x0020)  /*!< Automatic Wakeup Mode */
#define CAN_MCR_ABOM ((uint16_t)0x0040)  /*!< Automatic Bus-Off Management */
#define CAN_MCR_TTCM ((uint16_t)0x0080)  /*!< Time Triggered Communication Mode */
#define CAN_MCR_RESET ((uint16_t)0x8000) /*!< CAN software master reset */

/*******************  Bit definition for CAN_MSR register  ********************/
#define CAN_MSR_INAK ((uint16_t)0x0001)  /*!< Initialization Acknowledge */
#define CAN_MSR_SLAK ((uint16_t)0x0002)  /*!< Sleep Acknowledge */
#define CAN_MSR_ERRI ((uint16_t)0x0004)  /*!< Error Interrupt */
#define CAN_MSR_WKUI ((uint16_t)0x0008)  /*!< Wakeup Interrupt */
#define CAN_MSR_SLAKI ((uint16_t)0x0010) /*!< Sleep Acknowledge Interrupt */
#define CAN_MSR_TXM ((uint16_t)0x0100)   /*!< Transmit Mode */
#define CAN_MSR_RXM ((uint16_t)0x0200)   /*!< Receive Mode */
#define CAN_MSR_SAMP ((uint16_t)0x0400)  /*!< Last Sample Point */
#define CAN_MSR_RX ((uint16_t)0x0800)    /*!< CAN Rx Signal */

/*******************  Bit definition for CAN_TSR register  ********************/
#define CAN_TSR_RQCP0 ((uint32_t)0x00000001) /*!< Request Completed Mailbox0 */
#define CAN_TSR_TXOK0 ((uint32_t)0x00000002) /*!< Transmission OK of Mailbox0 */
#define CAN_TSR_ALST0 ((uint32_t)0x00000004) /*!< Arbitration Lost for Mailbox0 */
#define CAN_TSR_TERR0 ((uint32_t)0x00000008) /*!< Transmission Error of Mailbox0 */
#define CAN_TSR_ABRQ0 ((uint32_t)0x00000080) /*!< Abort Request for Mailbox0 */
#define CAN_TSR_RQCP1 ((uint32_t)0x00000100) /*!< Request Completed Mailbox1 */
#define CAN_TSR_TXOK1 ((uint32_t)0x00000200) /*!< Transmission OK of Mailbox1 */
#define CAN_TSR_ALST1 ((uint32_t)0x00000400) /*!< Arbitration Lost for Mailbox1 */
#define CAN_TSR_TERR1 ((uint32_t)0x00000800) /*!< Transmission Error of Mailbox1 */
#define CAN_TSR_ABRQ1 ((uint32_t)0x00008000) /*!< Abort Request for Mailbox 1 */
#define CAN_TSR_RQCP2 ((uint32_t)0x00010000) /*!< Request Completed Mailbox2 */
#define CAN_TSR_TXOK2 ((uint32_t)0x00020000) /*!< Transmission OK of Mailbox 2 */
#define CAN_TSR_ALST2 ((uint32_t)0x00040000) /*!< Arbitration Lost for mailbox 2 */
#define CAN_TSR_TERR2 ((uint32_t)0x00080000) /*!< Transmission Error of Mailbox 2 */
#define CAN_TSR_ABRQ2 ((uint32_t)0x00800000) /*!< Abort Request for Mailbox 2 */
#define CAN_TSR_CODE ((uint32_t)0x03000000)  /*!< Mailbox Code */

#define CAN_TSR_TME ((uint32_t)0x1C000000)  /*!< TME[2:0] bits */
#define CAN_TSR_TME0 ((uint32_t)0x04000000) /*!< Transmit Mailbox 0 Empty */
#define CAN_TSR_TME1 ((uint32_t)0x08000000) /*!< Transmit Mailbox 1 Empty */
#define CAN_TSR_TME2 ((uint32_t)0x10000000) /*!< Transmit Mailbox 2 Empty */

#define CAN_TSR_LOW ((uint32_t)0xE0000000)  /*!< LOW[2:0] bits */
#define CAN_TSR_LOW0 ((uint32_t)0x20000000) /*!< Lowest Priority Flag for Mailbox 0 */
#define CAN_TSR_LOW1 ((uint32_t)0x40000000) /*!< Lowest Priority Flag for Mailbox 1 */
#define CAN_TSR_LOW2 ((uint32_t)0x80000000) /*!< Lowest Priority Flag for Mailbox 2 */

/*******************  Bit definition for CAN_RF0R register  *******************/
#define CAN_RF0R_FMP0 ((uint8_t)0x03)  /*!< FIFO 0 Message Pending */
#define CAN_RF0R_FULL0 ((uint8_t)0x08) /*!< FIFO 0 Full */
#define CAN_RF0R_FOVR0 ((uint8_t)0x10) /*!< FIFO 0 Overrun */
#define CAN_RF0R_RFOM0 ((uint8_t)0x20) /*!< Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RF1R register  *******************/
#define CAN_RF1R_FMP1 ((uint8_t)0x03)  /*!< FIFO 1 Message Pending */
#define CAN_RF1R_FULL1 ((uint8_t)0x08) /*!< FIFO 1 Full */
#define CAN_RF1R_FOVR1 ((uint8_t)0x10) /*!< FIFO 1 Overrun */
#define CAN_RF1R_RFOM1 ((uint8_t)0x20) /*!< Release FIFO 1 Output Mailbox */

