daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/*******************  Bit definition for CAN_RDL0R register  ******************/
#define CAN_RDL0R_DATA0 ((uint32_t)0x000000FF) /*!< Data byte 0 */
#define CAN_RDL0R_DATA1 ((uint32_t)0x0000FF00) /*!< Data byte 1 */
#define CAN_RDL0R_DATA2 ((uint32_t)0x00FF0000) /*!< Data byte 2 */
#define CAN_RDL0R_DATA3 ((uint32_t)0xFF000000) /*!< Data byte 3 */

/*******************  Bit definition for CAN_RDH0R register  ******************/
#define CAN_RDH0R_DATA4 ((uint32_t)0x000000FF) /*!< Data byte 4 */
#define CAN_RDH0R_DATA5 ((uint32_t)0x0000FF00) /*!< Data byte 5 */
#define CAN_RDH0R_DATA6 ((uint32_t)0x00FF0000) /*!< Data byte 6 */
#define CAN_RDH0R_DATA7 ((uint32_t)0xFF000000) /*!< Data byte 7 */

/*******************  Bit definition for CAN_RI1R register  *******************/
#define CAN_RI1R_RTR ((uint32_t)0x00000002)  /*!< Remote Transmission Request */
#define CAN_RI1R_IDE ((uint32_t)0x00000004)  /*!< Identifier Extension */
#define CAN_RI1R_EXID ((uint32_t)0x001FFFF8) /*!< Extended identifier */
#define CAN_RI1R_STID ((uint32_t)0xFFE00000) /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RDT1R register  ******************/
#define CAN_RDT1R_DLC ((uint32_t)0x0000000F)  /*!< Data Length Code */
#define CAN_RDT1R_FMI ((uint32_t)0x0000FF00)  /*!< Filter Match Index */
#define CAN_RDT1R_TIME ((uint32_t)0xFFFF0000) /*!< Message Time Stamp */

/*******************  Bit definition for CAN_RDL1R register  ******************/
#define CAN_RDL1R_DATA0 ((uint32_t)0x000000FF) /*!< Data byte 0 */
#define CAN_RDL1R_DATA1 ((uint32_t)0x0000FF00) /*!< Data byte 1 */
#define CAN_RDL1R_DATA2 ((uint32_t)0x00FF0000) /*!< Data byte 2 */
#define CAN_RDL1R_DATA3 ((uint32_t)0xFF000000) /*!< Data byte 3 */

/*******************  Bit definition for CAN_RDH1R register  ******************/
#define CAN_RDH1R_DATA4 ((uint32_t)0x000000FF) /*!< Data byte 4 */
#define CAN_RDH1R_DATA5 ((uint32_t)0x0000FF00) /*!< Data byte 5 */
#define CAN_RDH1R_DATA6 ((uint32_t)0x00FF0000) /*!< Data byte 6 */
#define CAN_RDH1R_DATA7 ((uint32_t)0xFF000000) /*!< Data byte 7 */

/*!< CAN filter registers */
/*******************  Bit definition for CAN_FMR register  ********************/
#define CAN_FMR_FINIT ((uint8_t)0x01) /*!< Filter Init Mode */

/*******************  Bit definition for CAN_FM1R register  *******************/
#define CAN_FM1R_FBM ((uint16_t)0x3FFF)   /*!< Filter Mode */

/*******************  Bit definition for CAN_FS1R register  *******************/
#define CAN_FS1R_FSC ((uint16_t)0x3FFF)   /*!< Filter Scale Configuration */

/******************  Bit definition for CAN_FFA1R register  *******************/
#define CAN_FFA1R_FFA ((uint16_t)0x3FFF)   /*!< Filter FIFO Assignment */

/*******************  Bit definition for CAN_FA1R register  *******************/
#define CAN_FA1R_FACT ((uint16_t)0x3FFF)   /*!< Filter Active */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_CPHA ((uint16_t)0x0001) /*!< Clock Phase */
#define SPI_CR1_CPOL ((uint16_t)0x0002) /*!< Clock Polarity */
#define SPI_CR1_MSTR ((uint16_t)0x0004) /*!< Master Selection */

#define SPI_CR1_BR ((uint16_t)0x0038)   /*!< BR[2:0] bits (Baud Rate Control) */

#define SPI_CR1_SPE ((uint16_t)0x0040)      /*!< SPI Enable */
#define SPI_CR1_LSBFIRST ((uint16_t)0x0080) /*!< Frame Format */
#define SPI_CR1_SSI ((uint16_t)0x0100)      /*!< Internal slave select */
#define SPI_CR1_SSM ((uint16_t)0x0200)      /*!< Software slave management */
#define SPI_CR1_RXONLY ((uint16_t)0x0400)   /*!< Receive only */
#define SPI_CR1_DFF ((uint16_t)0x0800)      /*!< Data Frame Format */
#define SPI_CR1_CRCNEXT ((uint16_t)0x1000)  /*!< Transmit CRC next */
#define SPI_CR1_CRCEN ((uint16_t)0x2000)    /*!< Hardware CRC calculation enable */
#define SPI_CR1_BIDIOE ((uint16_t)0x4000)   /*!< Output enable in bidirectional mode */
#define SPI_CR1_BIDIMODE ((uint16_t)0x8000) /*!< Bidirectional data mode enable */

/*******************  Bit definition for SPI_CR2 register  ********************/
#define SPI_CR2_RXDMAEN ((uint8_t)0x01) /*!< Rx Buffer DMA Enable */
#define SPI_CR2_TXDMAEN ((uint8_t)0x02) /*!< Tx Buffer DMA Enable */
#define SPI_CR2_SSOE ((uint8_t)0x04)    /*!< SS Output Enable */
#define SPI_CR2_ERRIE ((uint8_t)0x20)   /*!< Error Interrupt Enable */
#define SPI_CR2_RXNEIE ((uint8_t)0x40)  /*!< RX buffer Not Empty Interrupt Enable */
#define SPI_CR2_TXEIE ((uint8_t)0x80)   /*!< Tx buffer Empty Interrupt Enable */

/********************  Bit definition for SPI_SR register  ********************/
#define SPI_SR_RXNE ((uint8_t)0x01)   /*!< Receive buffer Not Empty */
#define SPI_SR_TXE ((uint8_t)0x02)    /*!< Transmit buffer Empty */
#define SPI_SR_CHSIDE ((uint8_t)0x04) /*!< Channel side */
#define SPI_SR_UDR ((uint8_t)0x08)    /*!< Underrun flag */
#define SPI_SR_CRCERR ((uint8_t)0x10) /*!< CRC Error flag */
#define SPI_SR_MODF ((uint8_t)0x20)   /*!< Mode fault */
#define SPI_SR_OVR ((uint8_t)0x40)    /*!< Overrun flag */
#define SPI_SR_BSY ((uint8_t)0x80)    /*!< Busy flag */

/********************  Bit definition for SPI_DR register  ********************/
#define SPI_DR_DR ((uint16_t)0xFFFF) /*!< Data Register */

/*******************  Bit definition for SPI_CRCPR register  ******************/
#define SPI_CRCPR_CRCPOLY ((uint16_t)0xFFFF) /*!< CRC polynomial register */

/******************  Bit definition for SPI_RXCRCR register  ******************/
#define SPI_RXCRCR_RXCRC ((uint16_t)0xFFFF) /*!< Rx CRC Register */

/******************  Bit definition for SPI_TXCRCR register  ******************/
#define SPI_TXCRCR_TXCRC ((uint16_t)0xFFFF) /*!< Tx CRC Register */

