daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define SPI_I2SCFGR_CHLEN ((uint16_t)0x0001) /*!< Channel length (number of bits per audio channel) */
#define SPI_I2SCFGR_DATLEN ((uint16_t)0x0006)   /*!< DATLEN[1:0] bits (Data length to be transferred) */
#define SPI_I2SCFGR_CKPOL ((uint16_t)0x0008) /*!< steady state clock polarity */
#define SPI_I2SCFGR_I2SSTD ((uint16_t)0x0030)   /*!< I2SSTD[1:0] bits (I2S standard selection) */
#define SPI_I2SCFGR_PCMSYNC ((uint16_t)0x0080) /*!< PCM frame synchronization */
#define SPI_I2SCFGR_I2SCFG ((uint16_t)0x0300)   /*!< I2SCFG[1:0] bits (I2S configuration mode) */
#define SPI_I2SCFGR_I2SE ((uint16_t)0x0400)   /*!< I2S Enable */
#define SPI_I2SCFGR_I2SMOD ((uint16_t)0x0800) /*!< I2S mode selection */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define SPI_I2SPR_I2SDIV ((uint16_t)0x00FF) /*!< I2S Linear prescaler */
#define SPI_I2SPR_ODD ((uint16_t)0x0100)    /*!< Odd factor for the prescaler */
#define SPI_I2SPR_MCKOE ((uint16_t)0x0200)  /*!< Master Clock Output Enable */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CR1 register  ********************/
#define I2C_CR1_PE ((uint16_t)0x0001)        /*!< Peripheral Enable */
#define I2C_CR1_SMBUS ((uint16_t)0x0002)     /*!< SMBus Mode */
#define I2C_CR1_SMBTYPE ((uint16_t)0x0008)   /*!< SMBus Type */
#define I2C_CR1_ENARP ((uint16_t)0x0010)     /*!< ARP Enable */
#define I2C_CR1_ENPEC ((uint16_t)0x0020)     /*!< PEC Enable */
#define I2C_CR1_ENGC ((uint16_t)0x0040)      /*!< General Call Enable */
#define I2C_CR1_NOSTRETCH ((uint16_t)0x0080) /*!< Clock Stretching Disable (Slave mode) */
#define I2C_CR1_START ((uint16_t)0x0100)     /*!< Start Generation */
#define I2C_CR1_STOP ((uint16_t)0x0200)      /*!< Stop Generation */
#define I2C_CR1_ACK ((uint16_t)0x0400)       /*!< Acknowledge Enable */
#define I2C_CR1_POS ((uint16_t)0x0800)       /*!< Acknowledge/PEC Position (for data reception) */
#define I2C_CR1_PEC ((uint16_t)0x1000)       /*!< Packet Error Checking */
#define I2C_CR1_ALERT ((uint16_t)0x2000)     /*!< SMBus Alert */
#define I2C_CR1_SWRST ((uint16_t)0x8000)     /*!< Software Reset */

/*******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_FREQ ((uint16_t)0x003F)   /*!< FREQ[5:0] bits (Peripheral Clock Frequency) */
#define I2C_CR2_ITERREN ((uint16_t)0x0100) /*!< Error Interrupt Enable */
#define I2C_CR2_ITEVTEN ((uint16_t)0x0200) /*!< Event Interrupt Enable */
#define I2C_CR2_ITBUFEN ((uint16_t)0x0400) /*!< Buffer Interrupt Enable */
#define I2C_CR2_DMAEN ((uint16_t)0x0800)   /*!< DMA Requests Enable */
#define I2C_CR2_LAST ((uint16_t)0x1000)    /*!< DMA Last Transfer */

/*******************  Bit definition for I2C_OAR1 register  *******************/
#define I2C_OAR1_ADD1_7 ((uint16_t)0x00FE) /*!< Interface Address */
#define I2C_OAR1_ADD8_9 ((uint16_t)0x0300) /*!< Interface Address */
#define I2C_OAR1_ADDMODE ((uint16_t)0x8000) /*!< Addressing Mode (Slave mode) */

/*******************  Bit definition for I2C_OAR2 register  *******************/
#define I2C_OAR2_ENDUAL ((uint8_t)0x01) /*!< Dual addressing mode enable */
#define I2C_OAR2_ADD2 ((uint8_t)0xFE)   /*!< Interface address */

/********************  Bit definition for I2C_DR register  ********************/
#define I2C_DR_DR ((uint8_t)0xFF) /*!< 8-bit Data Register */

/*******************  Bit definition for I2C_SR1 register  ********************/
#define I2C_SR1_SB ((uint16_t)0x0001)       /*!< Start Bit (Master mode) */
#define I2C_SR1_ADDR ((uint16_t)0x0002)     /*!< Address sent (master mode)/matched (slave mode) */
#define I2C_SR1_BTF ((uint16_t)0x0004)      /*!< Byte Transfer Finished */
#define I2C_SR1_ADD10 ((uint16_t)0x0008)    /*!< 10-bit header sent (Master mode) */
#define I2C_SR1_STOPF ((uint16_t)0x0010)    /*!< Stop detection (Slave mode) */
#define I2C_SR1_RXNE ((uint16_t)0x0040)     /*!< Data Register not Empty (receivers) */
#define I2C_SR1_TXE ((uint16_t)0x0080)      /*!< Data Register Empty (transmitters) */
#define I2C_SR1_BERR ((uint16_t)0x0100)     /*!< Bus Error */
#define I2C_SR1_ARLO ((uint16_t)0x0200)     /*!< Arbitration Lost (master mode) */
#define I2C_SR1_AF ((uint16_t)0x0400)       /*!< Acknowledge Failure */
#define I2C_SR1_OVR ((uint16_t)0x0800)      /*!< Overrun/Underrun */
#define I2C_SR1_PECERR ((uint16_t)0x1000)   /*!< PEC Error in reception */
#define I2C_SR1_TIMEOUT ((uint16_t)0x4000)  /*!< Timeout or Tlow Error */
#define I2C_SR1_SMBALERT ((uint16_t)0x8000) /*!< SMBus Alert */

/*******************  Bit definition for I2C_SR2 register  ********************/
#define I2C_SR2_MSL ((uint16_t)0x0001)        /*!< Master/Slave */
#define I2C_SR2_BUSY ((uint16_t)0x0002)       /*!< Bus Busy */
#define I2C_SR2_TRA ((uint16_t)0x0004)        /*!< Transmitter/Receiver */
#define I2C_SR2_GENCALL ((uint16_t)0x0010)    /*!< General Call Address (Slave mode) */
#define I2C_SR2_SMBDEFAULT ((uint16_t)0x0020) /*!< SMBus Device Default Address (Slave mode) */
#define I2C_SR2_SMBHOST ((uint16_t)0x0040)    /*!< SMBus Host Header (Slave mode) */
#define I2C_SR2_DUALF ((uint16_t)0x0080)      /*!< Dual Flag (Slave mode) */
#define I2C_SR2_PEC ((uint16_t)0xFF00)        /*!< Packet Error Checking Register */

/*******************  Bit definition for I2C_CCR register  ********************/
#define I2C_CCR_CCR ((uint16_t)0x0FFF)  /*!< Clock Control Register in Fast/Standard mode (Master mode) */
#define I2C_CCR_DUTY ((uint16_t)0x4000) /*!< Fast Mode Duty Cycle */
#define I2C_CCR_FS ((uint16_t)0x8000)   /*!< I2C Master Mode Selection */

/******************  Bit definition for I2C_TRISE register  *******************/
#define I2C_TRISE_TRISE ((uint8_t)0x3F) /*!< Maximum Rise Time in Fast/Standard mode (Master mode) */

/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/

