daedaleanai/stm32f103_xvcusb/stm32f103_md.h
/*******************  Bit definition for USART_SR register  *******************/
#define USART_SR_PE ((uint16_t)0x0001)   /*!< Parity Error */
#define USART_SR_FE ((uint16_t)0x0002)   /*!< Framing Error */
#define USART_SR_NE ((uint16_t)0x0004)   /*!< Noise Error Flag */
#define USART_SR_ORE ((uint16_t)0x0008)  /*!< OverRun Error */
#define USART_SR_IDLE ((uint16_t)0x0010) /*!< IDLE line detected */
#define USART_SR_RXNE ((uint16_t)0x0020) /*!< Read Data Register Not Empty */
#define USART_SR_TC ((uint16_t)0x0040)   /*!< Transmission Complete */
#define USART_SR_TXE ((uint16_t)0x0080)  /*!< Transmit Data Register Empty */
#define USART_SR_LBD ((uint16_t)0x0100)  /*!< LIN Break Detection Flag */
#define USART_SR_CTS ((uint16_t)0x0200)  /*!< CTS Flag */

/*******************  Bit definition for USART_DR register  *******************/
#define USART_DR_DR ((uint16_t)0x01FF) /*!< Data value */

/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_DIV_Fraction ((uint16_t)0x000F) /*!< Fraction of USARTDIV */
#define USART_BRR_DIV_Mantissa ((uint16_t)0xFFF0) /*!< Mantissa of USARTDIV */

/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_SBK ((uint16_t)0x0001)    /*!< Send Break */
#define USART_CR1_RWU ((uint16_t)0x0002)    /*!< Receiver wakeup */
#define USART_CR1_RE ((uint16_t)0x0004)     /*!< Receiver Enable */
#define USART_CR1_TE ((uint16_t)0x0008)     /*!< Transmitter Enable */
#define USART_CR1_IDLEIE ((uint16_t)0x0010) /*!< IDLE Interrupt Enable */
#define USART_CR1_RXNEIE ((uint16_t)0x0020) /*!< RXNE Interrupt Enable */
#define USART_CR1_TCIE ((uint16_t)0x0040)   /*!< Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE ((uint16_t)0x0080)  /*!< PE Interrupt Enable */
#define USART_CR1_PEIE ((uint16_t)0x0100)   /*!< PE Interrupt Enable */
#define USART_CR1_PS ((uint16_t)0x0200)     /*!< Parity Selection */
#define USART_CR1_PCE ((uint16_t)0x0400)    /*!< Parity Control Enable */
#define USART_CR1_WAKE ((uint16_t)0x0800)   /*!< Wakeup method */
#define USART_CR1_M ((uint16_t)0x1000)      /*!< Word length */
#define USART_CR1_UE ((uint16_t)0x2000)     /*!< USART Enable */
#define USART_CR1_OVER8 ((uint16_t)0x8000)  /*!< USART Oversmapling 8-bits */

/******************  Bit definition for USART_CR2 register  *******************/
#define USART_CR2_ADD ((uint16_t)0x000F)   /*!< Address of the USART node */
#define USART_CR2_LBDL ((uint16_t)0x0020)  /*!< LIN Break Detection Length */
#define USART_CR2_LBDIE ((uint16_t)0x0040) /*!< LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL ((uint16_t)0x0100)  /*!< Last Bit Clock pulse */
#define USART_CR2_CPHA ((uint16_t)0x0200)  /*!< Clock Phase */
#define USART_CR2_CPOL ((uint16_t)0x0400)  /*!< Clock Polarity */
#define USART_CR2_CLKEN ((uint16_t)0x0800) /*!< Clock Enable */

#define USART_CR2_STOP ((uint16_t)0x3000)   /*!< STOP[1:0] bits (STOP bits) */
#define USART_CR2_LINEN ((uint16_t)0x4000) /*!< LIN mode enable */

/******************  Bit definition for USART_CR3 register  *******************/
#define USART_CR3_EIE ((uint16_t)0x0001)    /*!< Error Interrupt Enable */
#define USART_CR3_IREN ((uint16_t)0x0002)   /*!< IrDA mode Enable */
#define USART_CR3_IRLP ((uint16_t)0x0004)   /*!< IrDA Low-Power */
#define USART_CR3_HDSEL ((uint16_t)0x0008)  /*!< Half-Duplex Selection */
#define USART_CR3_NACK ((uint16_t)0x0010)   /*!< Smartcard NACK enable */
#define USART_CR3_SCEN ((uint16_t)0x0020)   /*!< Smartcard mode enable */
#define USART_CR3_DMAR ((uint16_t)0x0040)   /*!< DMA Enable Receiver */
#define USART_CR3_DMAT ((uint16_t)0x0080)   /*!< DMA Enable Transmitter */
#define USART_CR3_RTSE ((uint16_t)0x0100)   /*!< RTS Enable */
#define USART_CR3_CTSE ((uint16_t)0x0200)   /*!< CTS Enable */
#define USART_CR3_CTSIE ((uint16_t)0x0400)  /*!< CTS Interrupt Enable */
#define USART_CR3_ONEBIT ((uint16_t)0x0800) /*!< One Bit method */

/******************  Bit definition for USART_GTPR register  ******************/
#define USART_GTPR_PSC ((uint16_t)0x00FF)   /*!< PSC[7:0] bits (Prescaler value) */
#define USART_GTPR_GT ((uint16_t)0xFF00) /*!< Guard time value */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define DBGMCU_IDCODE_DEV_ID ((uint32_t)0x00000FFF) /*!< Device Identifier */

#define DBGMCU_IDCODE_REV_ID ((uint32_t)0xFFFF0000)    /*!< REV_ID[15:0] bits (Revision Identifier) */

/******************  Bit definition for DBGMCU_CR register  *******************/
#define DBGMCU_CR_DBG_SLEEP ((uint32_t)0x00000001)   /*!< Debug Sleep Mode */
#define DBGMCU_CR_DBG_STOP ((uint32_t)0x00000002)    /*!< Debug Stop Mode */
#define DBGMCU_CR_DBG_STANDBY ((uint32_t)0x00000004) /*!< Debug Standby mode */
#define DBGMCU_CR_TRACE_IOEN ((uint32_t)0x00000020)  /*!< Trace Pin Assignment Control */

#define DBGMCU_CR_TRACE_MODE ((uint32_t)0x000000C0)   /*!< TRACE_MODE[1:0] bits (Trace Pin Assignment Control) */
#define DBGMCU_CR_TRACE_MODE_0 ((uint32_t)0x00000040) /*!< Bit 0 */
#define DBGMCU_CR_TRACE_MODE_1 ((uint32_t)0x00000080) /*!< Bit 1 */

#define DBGMCU_CR_DBG_IWDG_STOP ((uint32_t)0x00000100)          /*!< Debug Independent Watchdog stopped when Core is halted */
#define DBGMCU_CR_DBG_WWDG_STOP ((uint32_t)0x00000200)          /*!< Debug Window Watchdog stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM1_STOP ((uint32_t)0x00000400)          /*!< TIM1 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM2_STOP ((uint32_t)0x00000800)          /*!< TIM2 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM3_STOP ((uint32_t)0x00001000)          /*!< TIM3 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM4_STOP ((uint32_t)0x00002000)          /*!< TIM4 counter stopped when core is halted */
#define DBGMCU_CR_DBG_CAN1_STOP ((uint32_t)0x00004000)          /*!< Debug CAN1 stopped when Core is halted */
#define DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT ((uint32_t)0x00008000) /*!< SMBUS timeout mode stopped when Core is halted */
#define DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT ((uint32_t)0x00010000) /*!< SMBUS timeout mode stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM8_STOP ((uint32_t)0x00020000)          /*!< TIM8 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM5_STOP ((uint32_t)0x00040000)          /*!< TIM5 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM6_STOP ((uint32_t)0x00080000)          /*!< TIM6 counter stopped when core is halted */
#define DBGMCU_CR_DBG_TIM7_STOP ((uint32_t)0x00100000)          /*!< TIM7 counter stopped when core is halted */
#define DBGMCU_CR_DBG_CAN2_STOP ((uint32_t)0x00200000)          /*!< Debug CAN2 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM15_STOP ((uint32_t)0x00400000)         /*!< Debug TIM15 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM16_STOP ((uint32_t)0x00800000)         /*!< Debug TIM16 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM17_STOP ((uint32_t)0x01000000)         /*!< Debug TIM17 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM12_STOP ((uint32_t)0x02000000)         /*!< Debug TIM12 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM13_STOP ((uint32_t)0x04000000)         /*!< Debug TIM13 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM14_STOP ((uint32_t)0x08000000)         /*!< Debug TIM14 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM9_STOP ((uint32_t)0x10000000)          /*!< Debug TIM9 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM10_STOP ((uint32_t)0x20000000)         /*!< Debug TIM10 stopped when Core is halted */
#define DBGMCU_CR_DBG_TIM11_STOP ((uint32_t)0x40000000)         /*!< Debug TIM11 stopped when Core is halted */

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define FLASH_ACR_LATENCY ((uint8_t)0x03)   /*!< LATENCY[2:0] bits (Latency) */
#define FLASH_ACR_LATENCY_0 ((uint8_t)0x00) /*!< Bit 0 */
#define FLASH_ACR_LATENCY_1 ((uint8_t)0x01) /*!< Bit 0 */
#define FLASH_ACR_LATENCY_2 ((uint8_t)0x02) /*!< Bit 1 */

#define FLASH_ACR_HLFCYA ((uint8_t)0x08) /*!< Flash Half Cycle Access Enable */
#define FLASH_ACR_PRFTBE ((uint8_t)0x10) /*!< Prefetch Buffer Enable */
#define FLASH_ACR_PRFTBS ((uint8_t)0x20) /*!< Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define FLASH_KEYR_FKEYR ((uint32_t)0xFFFFFFFF) /*!< FPEC Key */

